In [1]:
%%!
pip3 install --trusted-host pypi.org ipython-sql

['Requirement already satisfied: ipython-sql in /usr/local/lib/python3.7/site-packages (0.3.9)',
 'Requirement already satisfied: sqlalchemy>=0.6.7 in /usr/local/lib/python3.7/site-packages (from ipython-sql) (1.3.8)',
 'Requirement already satisfied: six in /usr/local/Cellar/protobuf/3.7.1/libexec/lib/python3.7/site-packages (from ipython-sql) (1.12.0)',
 'Requirement already satisfied: ipython>=1.0 in /usr/local/lib/python3.7/site-packages (from ipython-sql) (7.5.0)',
 'Requirement already satisfied: prettytable in /usr/local/lib/python3.7/site-packages (from ipython-sql) (0.7.2)',
 'Requirement already satisfied: sqlparse in /usr/local/lib/python3.7/site-packages (from ipython-sql) (0.3.0)',
 'Requirement already satisfied: ipython-genutils>=0.1.0 in /usr/local/lib/python3.7/site-packages (from ipython-sql) (0.2.0)',
 'Requirement already satisfied: pexpect; sys_platform != "win32" in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.7.0)',
 'Requirement already satisfied: jedi>=0.10 in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.13.3)',
 'Requirement already satisfied: traitlets>=4.2 in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.3.2)',
 'Requirement already satisfied: prompt-toolkit<2.1.0,>=2.0.0 in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.0.9)',
 'Requirement already satisfied: backcall in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)',
 'Requirement already satisfied: decorator in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (4.4.0)',
 'Requirement already satisfied: appnope; sys_platform == "darwin" in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.1.0)',
 'Requirement already satisfied: pygments in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (2.3.1)',
 'Requirement already satisfied: pickleshare in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (0.7.5)',
 'Requirement already satisfied: setuptools>=18.5 in /usr/local/lib/python3.7/site-packages (from ipython>=1.0->ipython-sql) (40.8.0)',
 'Requirement already satisfied: ptyprocess>=0.5 in /usr/local/lib/python3.7/site-packages (from pexpect; sys_platform != "win32"->ipython>=1.0->ipython-sql) (0.6.0)',
 'Requirement already satisfied: parso>=0.3.0 in /usr/local/lib/python3.7/site-packages (from jedi>=0.10->ipython>=1.0->ipython-sql) (0.4.0)',
 'Requirement already satisfied: wcwidth in /usr/local/lib/python3.7/site-packages (from prompt-toolkit<2.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.1.7)']

In [5]:
%%!
pip3 install pymysql

['Collecting pymysql',
 '  Downloading https://files.pythonhosted.org/packages/ed/39/15045ae46f2a123019aa968dfcba0396c161c20f855f11dea6796bcaae95/PyMySQL-0.9.3-py2.py3-none-any.whl (47kB)',
 'Installing collected packages: pymysql',
 'Successfully installed pymysql-0.9.3']

In [12]:
%reload_ext sql

In [18]:
%%!
ssh -L 3306:localhost:3306 y454yang@ecelinux4.uwaterloo.ca

['Pseudo-terminal will not be allocated because stdin is not a terminal.',
 'bind [127.0.0.1]:3306: Address already in use']

In [20]:
%sql mysql+pymysql://root@localhost:3306

'Connected: root@None'

In [14]:
%%sql

USE ece356db_test;

 * mysql+pymysql://root:***@localhost:3306
0 rows affected.

[]

In [10]:
%%sql

SELECT * FROM Course WHERE course_id='BIO-101';

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('BIO-101', 'Intro. to Biology', 'Biology', Decimal('4'))]

# Brief History of SQL

- SEQUAL (Structured English Query Language) developed for *System R* project at IBM in early 1970s. Later shortened to SQL (Structured Query Language)

- Standardized by ANSI (since 1986) and ISO (since 1987)
    - SQL-86: first cut
    - SQL-89: added *Integrity Constraints*
    - **SQL-92**: *DATE* and *VARCHAR* types, *NATURAL JOIN*
    - SQL:1999: regular expressions, recursive queries, triggers
    - SQL:2003: XML support, auto-generated values
    - SQL:2008: revisions to cursors and triggers
    - SQL:2011: support for temporal databases

# SQL DDL, DML, DCL, TCL

### DDL

- Data Definition Language
- provides the ability to specify schema includes domains and integrity constraints
    - e.g., create tables and declare foreign keys

### DML

- Data Manipulation Language
- provides the ability to query, insert, delete, update data
    - e.g., SELECT

### DCL
- Data Control Language
- grant access privileges to users and revoke such privileges

### TCL
- Transaction Control Language
- control the execution of transaction

# Multiset Relations

- SQL borrows concepts from both relational algebra and relational calculus
- removing duplicates is expensive, in practice relational databases allow duplicate tuples in relations, including in query results
- relations are treated as **multisets**
- note: primary keys avoid duplicate tuples in tables but not in intermediate query results
- basic SQL constructs can be defined formally using relation algebra over multiset relations
- Given multiset relations $r_1$ and $r_2$:
    - $\sigma_{\theta}(r_1)$: if there are $c_1$ copies of tuple $t_1$ in $r_1$ and $t_1$ satisfies $\theta$, then there are $c_1$ copies of $t_1$ in $\sigma_{\theta}(r_1)$
    - $\Pi_A(r)$: For each copy of tuple $t_1$ in $r_1$, there is a copy of tuple $\Pi_A(t_1)$ in $\Pi_A(r_1)$ where $\Pi_A(t_1)$ denotes the projection of the single tuple $t_1$
    - $r_1 \times r_2$: if there are $c_1$ copies of tuple $t_1$ in $r_1$ and $c_2$ copies of tuple $t_2$ in $r_2$, then there are $c_1 \times c_2$ copies of the tuple $t_1 . t_2$ in $r_1 \times r_2$

# Basic Query Structure

```SQL
SELECT A1, A2, ..., An -- corresponds to projection in relational algebra
FROM r1, r2, ..., rm -- corresponds to Cartesian product in relational algebra
WHERE P -- corresponds to selection in relational algebra
```
- $A_i$ represents an attribute
- $r_i$ represents a relation
- $P$ is a predicate over the relation
- the result of an SQL query is a multiset relation
- the query is equivalent to the multiset version of the relational algebra expression
\begin{equation}
\Pi_{A_1, A_2,...,A_n}(\sigma_P(r_1 \times r_2 \times ... \times r_m))
\end{equation}

## The SELECT Clause

- lists the requested attributes in the result of a query
- correponds to projection in relational algebra
- example: find the names of all instructors
    - `SELECT name FROM instructor`
- the keyword `distinct` eliminates duplicates, the keyword `all` keeps duplicates, (`all` is default in MySQL)
    - `SELECT DISTINCT dept_name FROM instructor`
    - `SELECT ALL dept_name FROM instructor`
- an asterisk in the select clause denotes "all attributes"
    - `SELECT * FROM instructor`
- the select clause can contain *arithmetic expressions* involving the operators $+, -, *, /$, and operating on constants or attributes of tuples
    - `SELECT ID, name, salary/12 FROM instructor`

## The WHERE Clause
- specifies conditions that result must satisfy
- correponds to selection in relational algebra
- example: find all instructors in Physics with salary > 80000
    - `SELECT name FROM instructor WHERE dept_name="Physics" AND salary > 80000`
- comparison results can be combined using the logical connectives **and**, **or**, and **not**
- comparisons can be applied to results of arithmetic expressions

## The FROM  Clause
- lists the relations involved in the query
- correponds to Cartesian product in relational algebra
- example: find Cartesian product $instructor \times teaches$
    - `SELECT * FROM instructor, teaches`
    - generates every possible instructor-teaches pair with all attributes from both relations

# Theta Join

- an **inner join** with the **on** clause
- example: find the course ID, semester, year and title of each course offered in the Physics department

```SQL
SELECT section.course_id, semester, year, title
FROM section
INNER JOIN course
ON (section.course_id = course.course_id AND dept_name='Physics')
``` 
equivalent to

\begin{equation}
\Pi_{section.course\_id, semester, year, title}(section \bowtie_{section.course\_id = course.course\_id \land dept\_name='Physics'}course)
\end{equation}

\begin{equation}
\Pi_{section.course\_id, semester, year, title}
(\sigma_{section.course\_id = course.course\_id \land dept\_name='Physics'}
(section \times course))
\end{equation}

# Natural Join

- matches tuples with the same values for all common attributes, and ***retains only one copy of each common attribute***
- examples: find the names of instructors along with the course ID of the courses they teach
    - `SELECT name, course_id FROM instructor NATURAL JOIN teaches`
    - `SELECT name, course_id FROM instructor INNER JOIN teaches USING (ID)`
- danger: beware of unrelated attributes with same name that get equated incorrectly
- example: list the names of instructors along with the titles of courses  that they teach
    - incorrect solution (makes course.dept_name = instructor.dept_name):
        - ```SQL
        SELECT name, title FROM instructor NATURAL JOIN teaches NATURAL JOIN course
        ```
    - ```SQL
    SELECT name, title FROM instructor NATURAL JOIN teaches, course WHERE teaches.course_id = course.course_id
    ```
    - ```SQL
    SELECT name, title FROM instructor NATURAL JOIN teaches INNER JOIN course USING (course_id)
    ```

# The Rename Operation

- SQL allows renaming relations and attributes using the **as** clause
- `SELECT ID, name, salary/12 as monthly_salary FROM instructor`

# Set Operations

- find courses offered in Fall 2009 *or* in Spring 2010
```SQL
(SELECT course_id FROM section WHERE semester = 'Fall' AND year = 2009)
union
(SELECT course_id FROM section WHERE semester = 'Spring' AND year = 2010)
```

- find courses offered in Fall 2009 *and* in Spring 2010
```SQL
(SELECT course_id FROM section WHERE semester = 'Fall' AND year = 2009)
intersect
(SELECT course_id FROM section WHERE semester = 'Spring' AND year = 2010)
```

- find courses offered in Fall 2009 *but not* in Spring 2010
```SQL
(SELECT course_id FROM section WHERE semester = 'Fall' AND year = 2009)
except
(SELECT course_id FROM section WHERE semester = 'Spring' AND year = 2010)
```

- set operations **union**, **intersect**, **except** automatically eliminates duplicates
- to retain all duplicates, use the multiset versions **union all**, **intersect all**, **except all**

# Aggregate Functions

- **avg, min, max, sum, count**
- use the keyword **distinct** to eliminate duplicates
    - e.g., `count(distinct ID)`
- find average salary of instructors in the Physics department
    - `SELECT AVG(salary) FROM instructor WHERE dept_name='Physics'`
- find the total number of instrutorcs who teach a course in Spring 2010
    - `SELECT count(distinct ID) FROM teaches WHERE semester = 'Spring' AND year = 2010`
- find the number of tuples in the course relation
    - `SELECT count(*) FROM course`
- attributes in *select* clause outside of aggregate functions must appear in the **group by** list
    - bad example: `SELECT dept_name, name, avg(salary) FROM instructor GROUP BY dept_name`
- aggregation with "Having" Clause
    - e.g., `SELECT dept_name, avg(salary) FROM instructor GROUP BY dept_name HAVING avg(salary) > 42000`
    - predicates in the **having** clause are applied after the formation of groups wheras predicates in the **where** clause are applied before forming groups

# Ordering

- **order by** with **desc** or **asc** (default)
- e.g., list in alphabetical order the names of all instructors
    - `SELECT DISTINCT name FROM instructor ORDER BY name`
- possible to sort on multiple attributes
    - `SELECT DISTINCT dept_name, name FROM instructor ORDER BY dept_name asc, name desc`
    - return distinct *combinations* of two attributes

# Nested Subqueries

- a **subquery** is a *select-from-where* expression that is nested within another query
- common use cases include performing tests for max/min **aggregated** value, **set membership** (e.g., a value is in the set or not), and **set cardinality** (e.g., set is empty or not), as well as performing set operations (e.g., union, intersect, difference)
- the **in** construct is used for testing set membership, it returns **true** if the value on the left is an element of the relation generated by a subquery on the right
    - `SELECT ... FROM ... WHERE value IN (subquery)`
    - `SELECT ... FROM ... WHERE value NOT IN (subquery)`

# Testing for Empty Relations

- the **exists** construct returns the value **true** if the argument subquery is nonempty
    - $\textrm{EXISTS } r \iff r\ne \emptyset$
    - $\textrm{NOT EXISTS } r \iff r = \emptyset$

# Scalar Subquery

- yields a single value
- an error occurs if the subquery returns more than one result tuple

In [16]:
%%sql
-- Find the name of the department (or departments if there is a tie) with the maximum average salary
SELECT dept_name FROM instructor
GROUP BY dept_name HAVING avg(salary) =
    (SELECT MAX(avgsal) FROM
     (SELECT AVG(salary) as avgsal FROM instructor GROUP BY dept_name)
     as maxsal)

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('Physics',)]

In [18]:
%%sql

-- find courses offered in Fall 2009 and in Spring 2010

SELECT DISTINCT course_id FROM section
WHERE semester='Fall' AND year=2009 AND course_id IN
 (SELECT DISTINCT course_id FROM section
  WHERE semester='Spring' AND year=2010)

 * mysql+pymysql://root:***@localhost:3306
2 rows affected.

[('CS-101',), ('MU-199',)]

In [19]:
%%sql

-- find courses offered in Fall 2009 but not in Spring 2010

SELECT DISTINCT course_id FROM section
WHERE semester='Fall' AND year=2009 AND course_id NOT IN
 (SELECT DISTINCT course_id FROM section
  WHERE semester='Spring' AND year=2010)

 * mysql+pymysql://root:***@localhost:3306
2 rows affected.

[('CS-347',), ('PHY-101',)]

In [21]:
%%sql

-- find all courses taught in both the Fall 2009 semester 
-- and in the Spring 2010 semester

SELECT course_id
FROM section AS S
WHERE semester='Fall' AND year=2009 AND
    EXISTS (
        SELECT course_id FROM section AS T
        WHERE semester='Spring' AND year=2010 AND S.course_id = T.course_id
    )

 * mysql+pymysql://root:***@localhost:3306
2 rows affected.

[('CS-101',), ('MU-199',)]

In [23]:
%%sql

-- find all students who have taken all courses offered in the Biology department
-- find every student S such that there does not exist a Biology course
-- C that S has not taken

SELECT DISTINCT S.ID, S.name
FROM student AS S
WHERE NOT EXISTS (
    SELECT course_id FROM course AS C
    WHERE C.dept_name='Biology' AND NOT EXISTS (
        SELECT T.course_id FROM takes AS T
        WHERE C.course_id = T.course_id AND S.ID = T.ID
    )
)

 * mysql+pymysql://root:***@localhost:3306
1 rows affected.

[('99999', 'Biofan')]

In [24]:
%%sql

SELECT dept_name,
    (SELECT count(*) FROM instructor
     WHERE department.dept_name = instructor.dept_name) AS num_instructors
FROM department

 * mysql+pymysql://root:***@localhost:3306
7 rows affected.

[('Biology', 1),
 ('Comp. Sci.', 3),
 ('Elec. Eng.', 1),
 ('Finance', 2),
 ('History', 2),
 ('Music', 1),
 ('Physics', 2)]